<a href="https://colab.research.google.com/github/RobSpiewakowski/nauka-data-science/blob/main/skrypty-colab/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Klasy pamięci i typy danych w SQL:

# NULL - wartość NULL (czyli nic)
# INTEGER - liczba całkowita ze znakiem, przechowywana w 1, 2, 3, 4, 6 lub 8 bajtach
# REAL - liczba rzeczywista, przechowywana jako 8-bajtowa liczba zmiennoprzecinkowa
# TEXT - element tekstowy, przechowywany przy użyciu określonego kodowania (np. UTF-8)
# BLOB - Zbiór danych przechowywany dokładnie tak, jak został wprowadzony.

In [ ]:
# Tworzenie bazy danych w SQLite DB: bez potrzeby tworzenia serwera:
import sqlite3
data_base = sqlite3.connect("SQLite.db")

# Nawiązywanie połączenia z kursorem poleceń SQL:
bd_kursor = data_base.cursor()

# Tworzenie tabeli w bazie danych:
bd_kursor.execute('''CREATE TABLE testowa (id integer, imie text, numer_zamowienia text, cena real)''')
bd_kursor.execute('''CREATE TABLE testowa2 (imie text, numer_zamowienia text)''')

# Wczytanie wiersza z danymi do tabeli:
bd_kursor.execute("INSERT INTO testowa VALUES (001,'Robert','10A', 12.99)")
bd_kursor.execute("INSERT INTO testowa2 VALUES ('Robert','10A')")

# Zapisanie zmian w bazie danych (KONIECZNE!!!):
data_base.commit()

OperationalError: table testowa already exists

In [ ]:
# Sprawdzenie typu utworzonej bazy danych:
type(data_base)

sqlite3.Connection

In [ ]:
# Odczytanie zapisanej tabeli:
bd = sqlite3.connect("SQLite.db")
kursor = bd.cursor()
kursor.execute("SELECT * FROM testowa")

# Wyświetl pierwszy wiersz tabeli:
print(kursor.fetchone())

(1, 'Robert', '10A', 12.99)

In [ ]:
# Dodanie kolejnych elementów do tabeli:
# Tworzymy listę z danymi:
dane = [(2,'Oliwia','11B',49.99), (3,'Piotr','16A',0.98), (4,'Monika','35T',25.00), (5,'Michal','236H',259.95), (6,'Weronika','75C',69.99)]
print(type(dane))

# Wczytanie danych:
kursor.executemany("INSERT INTO testowa VALUES (?,?,?,?)", dane)

# Zapisanie zmian:
bd.commit()

<class 'list'>

In [ ]:
# Wczytanie całej tabeli - metoda 1 na pętlę:
for a in kursor.execute("SELECT * FROM testowa"):
    print(a)

# Wczytanie całej tabeli - metoda 2 na komendę:
kursor.execute("SELECT * FROM testowa").fetchall()

# Zamknięcie bazy danych:
bd.close()
# Zanim otworzysz nowe połączenie, zamknij istniejące!

(1, 'Robert', '10A', 12.99)
(2, 'Oliwia', '11B', 49.99)
(3, 'Piotr', '16A', 0.98)
(4, 'Monika', '35T', 25.0)
(5, 'Michal', '236H', 259.95)
(6, 'Weronika', '75C', 69.99)
(2, 'Oliwia', '11B', 49.99)
(3, 'Piotr', '16A', 0.98)
(4, 'Monika', '35T', 25.0)
(5, 'Michal', '236H', 259.95)
(6, 'Weronika', '75C', 69.99)

In [ ]:
# Użycie Pandas dla pracy z SQLite:
# Wczytaj bibliotekę Pandas:
import pandas as pd

# Łączenie ze stworzoną bazą danych SQLite:
db_poloczenie = sqlite3.connect('SQLite.db')
# Użycie pandas jako wrappera dla pracy z danymi z bazy danych:
dane_df = pd.read_sql("select * from testowa;", db_poloczenie)

In [ ]:
# Wyświetl dane:
dane_df

    id      imie numer_zamowienia    cena
0    1    Robert              10A   12.99
1    2    Oliwia              11B   49.99
2    3     Piotr              16A    0.98
3    4    Monika              35T   25.00
4    5    Michal             236H  259.95
5    6  Weronika              75C   69.99
6    2    Oliwia              11B   49.99
7    3     Piotr              16A    0.98
8    4    Monika              35T   25.00
9    5    Michal             236H  259.95
10   6  Weronika              75C   69.99

In [ ]:
# Sprawdzanie kolumn:
dane_df.columns

Index(['id', 'imie', 'numer_zamowienia', 'cena'], dtype='object')

In [ ]:
# Wyświetlenie zawartości tabeli:
dane_df.head()

   id    imie numer_zamowienia    cena
0   1  Robert              10A   12.99
1   2  Oliwia              11B   49.99
2   3   Piotr              16A    0.98
3   4  Monika              35T   25.00
4   5  Michal             236H  259.95

In [ ]:
# Podstawowe funkcje SQL z wykorzystaniem Pandas:
import pandas as pd
db_polaczenie = sqlite3.connect("SQLite.db")

In [ ]:
# Ładowanie wybranych kolumn tabeli:
pd.read_sql("SELECT imie,numer_zamowienia FROM testowa", db_polaczenie)

        imie numer_zamowienia
0     Robert              10A
1     Oliwia              11B
2      Piotr              16A
3     Monika              35T
4     Michal             236H
5   Weronika              75C
6     Oliwia              11B
7      Piotr              16A
8     Monika              35T
9     Michal             236H
10  Weronika              75C

In [ ]:
# Sortowanie zawartości tabeli po wybranej kolumnie:
pd.read_sql("SELECT * FROM testowa ORDER BY imie", db_polaczenie)

    id      imie numer_zamowienia    cena
0    5    Michal             236H  259.95
1    5    Michal             236H  259.95
2    4    Monika              35T   25.00
3    4    Monika              35T   25.00
4    2    Oliwia              11B   49.99
5    2    Oliwia              11B   49.99
6    3     Piotr              16A    0.98
7    3     Piotr              16A    0.98
8    1    Robert              10A   12.99
9    6  Weronika              75C   69.99
10   6  Weronika              75C   69.99

In [ ]:
# Sortowanie zawartości tabeli po wybranej kolumnie w przeciwnej kolejności
pd.read_sql("SELECT * FROM testowa ORDER BY imie DESC", db_polaczenie)

    id      imie numer_zamowienia    cena
0    6  Weronika              75C   69.99
1    6  Weronika              75C   69.99
2    1    Robert              10A   12.99
3    3     Piotr              16A    0.98
4    3     Piotr              16A    0.98
5    2    Oliwia              11B   49.99
6    2    Oliwia              11B   49.99
7    4    Monika              35T   25.00
8    4    Monika              35T   25.00
9    5    Michal             236H  259.95
10   5    Michal             236H  259.95

In [ ]:
# Grupowanie kolumn po numer_zamowienia i obliczanie kwoty zamówienia:
pd.read_sql("SELECT sum(cena) as 'SUMA' FROM testowa GROUP BY numer_zamowienia", db_polaczenie)

     SUMA
0   12.99
1   99.98
2    1.96
3  519.90
4   50.00
5  139.98

In [ ]:
# Wczytywanie wierszy tabeli z pominięciem wybranego:
pd.read_sql("SELECT * FROM testowa WHERE imie NOT LIKE 'Michal'", db_polaczenie)

   id      imie numer_zamowienia   cena
0   1    Robert              10A  12.99
1   2    Oliwia              11B  49.99
2   3     Piotr              16A   0.98
3   4    Monika              35T  25.00
4   6  Weronika              75C  69.99
5   2    Oliwia              11B  49.99
6   3     Piotr              16A   0.98
7   4    Monika              35T  25.00
8   6  Weronika              75C  69.99

In [ ]:
# Wczytanie zamówień o wartości w zadanych widełkach (20 - 50):
pd.read_sql("SELECT * FROM testowa WHERE cena BETWEEN 20 AND 50", db_polaczenie)

   id    imie numer_zamowienia   cena
0   2  Oliwia              11B  49.99
1   4  Monika              35T  25.00
2   2  Oliwia              11B  49.99
3   4  Monika              35T  25.00

In [ ]:
# Wczytanie tylko unikalnych (bez powtórzeń) zamówień:
pd.read_sql("SELECT DISTINCT numer_zamowienia FROM testowa", db_polaczenie)

  numer_zamowienia
0              10A
1              11B
2              16A
3              35T
4             236H
5              75C

In [ ]:
# Łączenie tabel po numerze zamówienia:

# Wyświetl tabelę testowa:
tabela1 = pd.read_sql("SELECT * FROM testowa", db_polaczenie)
print(tabela1)
print("\n")

# Wyświetl tabelę testowa2:
tabela2 = pd.read_sql("SELECT * FROM testowa2", db_polaczenie)
print(tabela2)
print("\n")

# Złączenie tabel:
wynik = pd.read_sql('''SELECT *
                        FROM testowa2
                        LEFT JOIN testowa ON testowa2.numer_zamowienia=testowa.numer_zamowienia''', db_polaczenie)
print(wynik)

    id      imie numer_zamowienia    cena
0    1    Robert              10A   12.99
1    2    Oliwia              11B   49.99
2    3     Piotr              16A    0.98
3    4    Monika              35T   25.00
4    5    Michal             236H  259.95
5    6  Weronika              75C   69.99
6    2    Oliwia              11B   49.99
7    3     Piotr              16A    0.98
8    4    Monika              35T   25.00
9    5    Michal             236H  259.95
10   6  Weronika              75C   69.99


     imie numer_zamowienia
0  Robert              10A


     imie numer_zamowienia  id    imie numer_zamowienia   cena
0  Robert              10A   1  Robert              10A  12.99

In [ ]:
# Zamykanie
db_polaczenie.close()